app/controllers/posts_controller.rb

  def index
    @posts = Post.order(id: "DESC")
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    Post.create(content: params[:content])
---
INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('テックキャンプ', '2024-04-07 08:25:38.671265', '2024-04-07 08:25:38.671265')